Show / Hide Table of Contents
Class ReinfBarOnEdge
Representing reinforcement bar input on edge in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarOnEdge
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarOnEdge : ReinforcementGroup
Constructors
Improve this Doc   View Source
ReinfBarOnEdge()
Constructor
Declaration
public ReinfBarOnEdge()
Properties
Improve this Doc   View Source
AnchorLength
Anchor length of main bars, if MasterComponent is opening
Declaration
public double AnchorLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
Declaration
public Vector3D BarDistance { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
Distance
Distance between reinforcement layers
Declaration
public double Distance { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EdgePositionType
Position of reinforcement on edge
Declaration
public EdgePositionType EdgePositionType { get; set; }
Property Value
 Type |  Description
 EdgePositionType
Improve this Doc   View Source
ExtendDistanceBegin
Distance of extension of beginning
Declaration
public double ExtendDistanceBegin { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ExtendDistanceEnd
Distance of extension of end
Declaration
public double ExtendDistanceEnd { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ExtendTypeBegin
type of extension of beginning of bar
Declaration
public BarEndExtendType ExtendTypeBegin { get; set; }
Property Value
 Type |  Description
 BarEndExtendType
Improve this Doc   View Source
ExtendTypeEnd
type of extension of end of bar
Declaration
public BarEndExtendType ExtendTypeEnd { get; set; }
Property Value
 Type |  Description
 BarEndExtendType
Improve this Doc   View Source
Length
length of bar
Declaration
public double Length { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Master component of reinforcement
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterEdge
Master edge on Outline of MasterComponent
Declaration
public ReferenceElement MasterEdge { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
NumOfLayers
Number of layers
Declaration
public int NumOfLayers { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
PositionOnEdge
Position of beginning of bar from start or end of edge
Declaration
public double PositionOnEdge { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source